==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
ComplexCNN                               [64, 29]                  --
├─Sequential: 1-1                        [64, 512, 8, 8]           --
│    └─Conv2d: 2-1                       [64, 64, 256, 256]        1,792
│    └─BatchNorm2d: 2-2                  [64, 64, 256, 256]        128
│    └─ReLU: 2-3                         [64, 64, 256, 256]        --
│    └─MaxPool2d: 2-4                    [64, 64, 128, 128]        --
│    └─Conv2d: 2-5                       [64, 128, 128, 128]       73,856
│    └─BatchNorm2d: 2-6                  [64, 128, 128, 128]       256
│    └─ReLU: 2-7                         [64, 128, 128, 128]       --
│    └─MaxPool2d: 2-8                    [64, 128, 64, 64]         --
│    └─Conv2d: 2-9                       [64, 256, 64, 64]         295,168
│    └─BatchNorm2d: 2-10                 [64, 256, 64, 64]         512
│    └─ReLU: 2-11                        [64, 256, 64, 64]         --
│    └─Conv2d: 2-12                      [64, 256, 64, 64]         590,080
│    └─BatchNorm2d: 2-13                 [64, 256, 64, 64]         512
│    └─ReLU: 2-14                        [64, 256, 64, 64]         --
│    └─MaxPool2d: 2-15                   [64, 256, 32, 32]         --
│    └─Conv2d: 2-16                      [64, 512, 32, 32]         1,180,160
│    └─BatchNorm2d: 2-17                 [64, 512, 32, 32]         1,024
│    └─ReLU: 2-18                        [64, 512, 32, 32]         --
│    └─Conv2d: 2-19                      [64, 512, 32, 32]         2,359,808
│    └─BatchNorm2d: 2-20                 [64, 512, 32, 32]         1,024
│    └─ReLU: 2-21                        [64, 512, 32, 32]         --
│    └─MaxPool2d: 2-22                   [64, 512, 16, 16]         --
│    └─Conv2d: 2-23                      [64, 512, 16, 16]         2,359,808
│    └─BatchNorm2d: 2-24                 [64, 512, 16, 16]         1,024
│    └─ReLU: 2-25                        [64, 512, 16, 16]         --
│    └─MaxPool2d: 2-26                   [64, 512, 8, 8]           --
│    └─Dropout2d: 2-27                   [64, 512, 8, 8]           --
├─Sequential: 1-2                        [64, 29]                  --
│    └─Linear: 2-28                      [64, 4096]                134,221,824
│    └─ReLU: 2-29                        [64, 4096]                --
│    └─Dropout2d: 2-30                   [64, 4096]                --
│    └─Linear: 2-31                      [64, 2048]                8,390,656
│    └─ReLU: 2-32                        [64, 2048]                --
│    └─Dropout2d: 2-33                   [64, 2048]                --
│    └─Linear: 2-34                      [64, 29]                  59,421
==========================================================================================
Total params: 149,537,053
Trainable params: 149,537,053
Non-trainable params: 0
Total mult-adds (G): 596.81
==========================================================================================
Input size (MB): 50.33
Forward/backward pass size (MB): 9801.05
Params size (MB): 598.15
Estimated Total Size (MB): 10449.53
==========================================================================================