==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
FCNN3Layers                              [128, 29]                 --
├─Linear: 1-1                            [128, 2048]               402,655,232
├─ReLU: 1-2                              [128, 2048]               --
├─Dropout: 1-3                           [128, 2048]               --
├─Linear: 1-4                            [128, 512]                1,049,088
├─ReLU: 1-5                              [128, 512]                --
├─Dropout: 1-6                           [128, 512]                --
├─Linear: 1-7                            [128, 29]                 14,877
==========================================================================================
Total params: 403,719,197
Trainable params: 403,719,197
Non-trainable params: 0
Total mult-adds (G): 51.68
==========================================================================================
Input size (MB): 100.66
Forward/backward pass size (MB): 2.65
Params size (MB): 1614.88
Estimated Total Size (MB): 1718.19
==========================================================================================