==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
FCNN2Layers                              [128, 29]                 --
├─Linear: 1-1                            [128, 512]                100,663,808
├─ReLU: 1-2                              [128, 512]                --
├─Dropout: 1-3                           [128, 512]                --
├─Linear: 1-4                            [128, 29]                 14,877
==========================================================================================
Total params: 100,678,685
Trainable params: 100,678,685
Non-trainable params: 0
Total mult-adds (G): 12.89
==========================================================================================
Input size (MB): 100.66
Forward/backward pass size (MB): 0.55
Params size (MB): 402.71
Estimated Total Size (MB): 503.93
==========================================================================================