==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
FCNN1Layers                              [128, 29]                 --
├─Linear: 1-1                            [128, 29]                 5,701,661
==========================================================================================
Total params: 5,701,661
Trainable params: 5,701,661
Non-trainable params: 0
Total mult-adds (M): 729.81
==========================================================================================
Input size (MB): 100.66
Forward/backward pass size (MB): 0.03
Params size (MB): 22.81
Estimated Total Size (MB): 123.50
==========================================================================================