==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN2Conv                                 [128, 29]                 --
├─Conv2d: 1-1                            [128, 32, 256, 256]       2,432
├─ReLU: 1-2                              [128, 32, 256, 256]       --
├─MaxPool2d: 1-3                         [128, 32, 128, 128]       --
├─Dropout: 1-4                           [128, 32, 128, 128]       --
├─Conv2d: 1-5                            [128, 64, 128, 128]       18,496
├─ReLU: 1-6                              [128, 64, 128, 128]       --
├─MaxPool2d: 1-7                         [128, 64, 64, 64]         --
├─Dropout: 1-8                           [128, 64, 64, 64]         --
├─Linear: 1-9                            [128, 512]                134,218,240
├─ReLU: 1-10                             [128, 512]                --
├─Dropout: 1-11                          [128, 512]                --
├─Linear: 1-12                           [128, 29]                 14,877
==========================================================================================
Total params: 134,254,045
Trainable params: 134,254,045
Non-trainable params: 0
Total mult-adds (G): 76.37
==========================================================================================
Input size (MB): 100.66
Forward/backward pass size (MB): 3221.78
Params size (MB): 537.02
Estimated Total Size (MB): 3859.46
==========================================================================================