==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN3ConvNoBatchNorm                      [128, 29]                 --
├─Conv2d: 1-1                            [128, 32, 256, 256]       2,432
├─ReLU: 1-2                              [128, 32, 256, 256]       --
├─MaxPool2d: 1-3                         [128, 32, 128, 128]       --
├─Conv2d: 1-4                            [128, 64, 128, 128]       18,496
├─ReLU: 1-5                              [128, 64, 128, 128]       --
├─MaxPool2d: 1-6                         [128, 64, 64, 64]         --
├─Dropout: 1-7                           [128, 64, 64, 64]         --
├─Conv2d: 1-8                            [128, 128, 64, 64]        73,856
├─ReLU: 1-9                              [128, 128, 64, 64]        --
├─MaxPool2d: 1-10                        [128, 128, 32, 32]        --
├─Dropout: 1-11                          [128, 128, 32, 32]        --
├─Linear: 1-12                           [128, 512]                67,109,376
├─ReLU: 1-13                             [128, 512]                --
├─Dropout: 1-14                          [128, 512]                --
├─Linear: 1-15                           [128, 29]                 14,877
==========================================================================================
Total params: 67,219,037
Trainable params: 67,219,037
Non-trainable params: 0
Total mult-adds (G): 106.50
==========================================================================================
Input size (MB): 100.66
Forward/backward pass size (MB): 3758.65
Params size (MB): 268.88
Estimated Total Size (MB): 4128.19
==========================================================================================