==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
CNN1Conv                                 [128, 29]                 --
├─Conv2d: 1-1                            [128, 20, 256, 256]       1,520
├─ReLU: 1-2                              [128, 20, 256, 256]       --
├─MaxPool2d: 1-3                         [128, 20, 128, 128]       --
├─Dropout: 1-4                           [128, 20, 128, 128]       --
├─Linear: 1-5                            [128, 512]                167,772,672
├─ReLU: 1-6                              [128, 512]                --
├─Dropout: 1-7                           [128, 512]                --
├─Linear: 1-8                            [128, 29]                 14,877
==========================================================================================
Total params: 167,789,069
Trainable params: 167,789,069
Non-trainable params: 0
Total mult-adds (G): 34.23
==========================================================================================
Input size (MB): 100.66
Forward/backward pass size (MB): 1342.73
Params size (MB): 671.16
Estimated Total Size (MB): 2114.55
==========================================================================================